posttest 4
rhesa simbolon
2109106105

import library

In [54]:
from sklearn.model_selection import train_test_split
from sklearn.datasets import load_iris
import pandas as pd
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler
import numpy as np
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import OneHotEncoder

In [19]:
df = pd.read_csv("smoking.csv")
df

,Unnamed: 0,gender,age,marital_status,highest_qualification,nationality,ethnicity,gross_income,region,smoke,amt_weekends,amt_weekdays,type
0,1,Male,38,Divorced,No Qualification,British,White,"2,600 to 5,200",The North,No,NaN,NaN,NaN
1,2,Female,42,Single,No Qualification,British,White,"Under 2,600",The North,Yes,12.0,12.0,Packets
2,3,Male,40,Married,Degree,English,White,"28,600 to 36,400",The North,No,NaN,NaN,NaN
3,4,Female,40,Married,Degree,English,White,"10,400 to 15,600",The North,No,NaN,NaN,NaN
4,5,Female,39,Married,GCSE/O Level,British,White,"2,600 to 5,200",The North,No,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1699,1687,Male,22,Single,No Qualification,Scottish,White,"2,600 to 5,200",Scotland,No,NaN,NaN,NaN
1700,1688,Female,49,Divorced,Other/Sub Degree,English,White,"2,600 to 5,200",Scotland,Yes,20.0,20.0,Hand-Rolled
1701,1689,Male,45,Married,Other/Sub Degree,Scottish,White,"5,200 to 10,400",Scotland,No,NaN,NaN,NaN
1702,1690,Female,51,Married,No Qualification,English,White,"2,600 to 5,200",Scotland,Yes,20.0,20.0,Packets
1703,1691,Male,31,Married,Degree,Scottish,White,"10,400 to 15,600",Scotland,No,NaN,NaN,NaN

Membagi dataset menjadi training set dan testing set dengan proporsi 70:30 menggunakan train_size, dan test_size

In [20]:
x = df.iloc[:,:-1] # Target
y = df.iloc[:,-1] # Feature
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size=0.3, train_size=0.7)

Print jumlah row dan kolom dari x train, x test, y train, y test

In [21]:
print("Dimensi X_train : ", X_train.shape)
print("Dimensi X_train : ", X_test.shape)
print("Dimensi y_train : ", y_train.shape)
print("Dimensi y_test  : ", y_test.shape)

Dimensi X_train :  (1192, 12)
Dimensi X_train :  (512, 12)
Dimensi y_train :  (1192,)
Dimensi y_test  :  (512,)

normalisasi data pada salah satu attribute menggunakan Min Max scaler¶

In [22]:
dataset_normalized =  df.copy()
Scaler = MinMaxScaler()
Normalized_Data = Scaler.fit_transform(dataset_normalized[['age']])
dataset_normalized['age'] = Normalized_Data

In [23]:
print("sebelum dinormalisasi: ")
print(df['age'].describe())
print('\n')
print("setelah dinormalisasi: ")
print(dataset_normalized['age'].describe())

sebelum dinormalisasi:
count    1704.000000
mean       49.752347
std        18.744872
min        16.000000
25%        34.000000
50%        48.000000
75%        65.000000
max        97.000000
Name: age, dtype: float64


setelah dinormalisasi:
count    1704.000000
mean        0.416696
std         0.231418
min         0.000000
25%         0.222222
50%         0.395062
75%         0.604938
max         1.000000
Name: age, dtype: float64

standarisasi

In [24]:
dataset_scaled =  df.copy()
ss = StandardScaler()
Scaled_data = ss.fit_transform(dataset_scaled[['age']])
dataset_scaled['age'] = Scaled_data

Menampilkan hasil dari standar deviasi sebelum di standarisasi, dan setelah di standarisasi

In [25]:
print("Nilai Data Sebelum scaling : ")
print("Nilai standar deviasi: ", np.std(df['age']))
print("\nNilai Data setelah scaling : ")
print("Nilai standar deviasi: ", np.std(dataset_scaled['age']))

Nilai Data Sebelum scaling :
Nilai standar deviasi:  18.739370862204144

Nilai Data setelah scaling :
Nilai standar deviasi:  1.0

data cleaning

In [26]:
print("Jumlah record yang memiliki nilai null :\n")
print(df.isna().sum())

Jumlah record yang memiliki nilai null :

Unnamed: 0                  0
gender                      0
age                         0
marital_status              0
highest_qualification       0
nationality                 0
ethnicity                   0
gross_income                0
region                      0
smoke                       0
amt_weekends             1283
amt_weekdays             1283
type                     1283
dtype: int64

In [27]:
dataset_clean = df.copy()
imputer1 = SimpleImputer(strategy='mean')
dataset_clean["amt_weekends"] = imputer1.fit_transform(dataset_clean[["amt_weekends"]])

In [28]:
imputer2 = SimpleImputer(strategy='median')
dataset_clean["amt_weekdays"] = imputer2.fit_transform(dataset_clean[["amt_weekdays"]])

In [29]:
imputer3 = SimpleImputer(strategy='most_frequent')
dataset_clean["type"] = imputer3.fit_transform(dataset_clean[["type"]])

In [30]:
print("Jumlah Nilai Null pada kolom amt_weekends sebelum Data Clean :", df['amt_weekends'].isna().sum())
print("Jumlah Nilai Null pada kolom amt_weekdays sebelum Data Clean :", df['amt_weekdays'].isna().sum())
print("Jumlah Nilai Null pada kolom type sebelum Data Clean         :", df['type'].isna().sum())
print("\nJumlah Nilai Null pada kolom amt_weekends setelah Data Clean :", dataset_clean['amt_weekends'].isna().sum())
print("Jumlah Nilai Null pada kolom amt_weekdays setelah Data Clean :", dataset_clean['amt_weekdays'].isna().sum())
print("Jumlah Nilai Null pada kolom type setelah Data Clean         :", dataset_clean['type'].isna().sum())

Jumlah Nilai Null pada kolom amt_weekends sebelum Data Clean : 1283
Jumlah Nilai Null pada kolom amt_weekdays sebelum Data Clean : 1283
Jumlah Nilai Null pada kolom type sebelum Data Clean         : 1283

Jumlah Nilai Null pada kolom amt_weekends setelah Data Clean : 0
Jumlah Nilai Null pada kolom amt_weekdays setelah Data Clean : 0
Jumlah Nilai Null pada kolom type setelah Data Clean         : 0

Membuat nilai duplikasi pada dataset dan menjumlahkan banyaknya data duplicat pada Data set

In [31]:
print("Jumlah Nilai Duplikat: ")
df.duplicated().sum()

Jumlah Nilai Duplikat:

13

In [32]:
df.drop_duplicates(inplace=True)

In [33]:
print("Setelah menggunakan fungsi drop_duplicates()")
print("Jumlah nilai Duplikat:", df.duplicated().sum())

Setelah menggunakan fungsi drop_duplicates()
Jumlah nilai Duplikat: 0

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1691 entries, 0 to 1703
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             1691 non-null   int64
 1   gender                 1691 non-null   object
 2   age                    1691 non-null   int64
 3   marital_status         1691 non-null   object
 4   highest_qualification  1691 non-null   object
 5   nationality            1691 non-null   object
 6   ethnicity              1691 non-null   object
 7   gross_income           1691 non-null   object
 8   region                 1691 non-null   object
 9   smoke                  1691 non-null   object
 10  amt_weekends           421 non-null    float64
 11  amt_weekdays           421 non-null    float64
 12  type                   421 non-null    object
dtypes: float64(2), int64(2), object(9)
memory usage: 185.0+ KB

encoding

In [38]:
df['age'] = df['age'].astype('float64')

In [40]:
dataset2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1691 entries, 0 to 1703
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             1691 non-null   int64
 1   gender                 1691 non-null   object
 2   age                    1691 non-null   float64
 3   marital_status         1691 non-null   object
 4   highest_qualification  1691 non-null   object
 5   nationality            1691 non-null   object
 6   ethnicity              1691 non-null   object
 7   gross_income           1691 non-null   object
 8   region                 1691 non-null   object
 9   smoke                  1691 non-null   object
 10  amt_weekends           421 non-null    float64
 11  amt_weekdays           421 non-null    float64
 12  type                   421 non-null    object
dtypes: float64(3), int64(1), object(9)
memory usage: 185.0+ KB

In [56]:
encoder = OneHotEncoder()
SexEnc = encoder.fit_transform(df[["gender"]])
SexEnc = pd.DataFrame(SexEnc)
df["Female"] = SexEnc[0]
df["Male"] = SexEnc[0]
df.head()

,Unnamed: 0,gender,age,marital_status,highest_qualification,nationality,ethnicity,gross_income,region,smoke,amt_weekends,amt_weekdays,type,gender_Female,gender_Male,Female,Male
0,1,Male,38.0,Divorced,No Qualification,British,White,"2,600 to 5,200",The North,No,NaN,NaN,NaN,0,1,"(0, 1)\t1.0","(0, 1)\t1.0"
1,2,Female,42.0,Single,No Qualification,British,White,"Under 2,600",The North,Yes,12.0,12.0,Packets,1,0,"(0, 0)\t1.0","(0, 0)\t1.0"
2,3,Male,40.0,Married,Degree,English,White,"28,600 to 36,400",The North,No,NaN,NaN,NaN,0,1,"(0, 1)\t1.0","(0, 1)\t1.0"
3,4,Female,40.0,Married,Degree,English,White,"10,400 to 15,600",The North,No,NaN,NaN,NaN,1,0,"(0, 0)\t1.0","(0, 0)\t1.0"
4,5,Female,39.0,Married,GCSE/O Level,British,White,"2,600 to 5,200",The North,No,NaN,NaN,NaN,1,0,"(0, 0)\t1.0","(0, 0)\t1.0"